publish/html/链表.html
<?xml version="1.0" encoding="gb2312"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>链表</title>
<meta http-equiv="Content-Type" content="text/html;charset=gb2312"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-10-12 18:02:39 "/>
<meta name="author" content="emacsers"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="org.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">链表</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 序言 </a>
<ul>
<li><a href="#sec-1-1">1.1 数组的缺点 </a></li>
<li><a href="#sec-1-2">1.2 链表 </a></li>
</ul>
</li>
<li><a href="#sec-2">2 链接点 </a>
<ul>
<li><a href="#sec-2-1">2.1 特点 </a></li>
<li><a href="#sec-2-2">2.2 例子 </a></li>
</ul>
</li>
<li><a href="#sec-3">3 单链表 </a>
<ul>
<li><a href="#sec-3-1">3.1 特点 </a></li>
<li><a href="#sec-3-2">3.2 例子 </a></li>
</ul>
</li>
<li><a href="#sec-4">4 查找和删除指定链接点 </a>
<ul>
<li><a href="#sec-4-1">4.1 find </a></li>
<li><a href="#sec-4-2">4.2 delete </a></li>
<li><a href="#sec-4-3">4.3 例子 </a></li>
</ul>
</li>
<li><a href="#sec-5">5 双端链接点 </a>
<ul>
<li><a href="#sec-5-1">5.1 特点 </a></li>
<li><a href="#sec-5-2">5.2 例子 </a></li>
</ul>
</li>
<li><a href="#sec-6">6 链表的效率 </a></li>
<li><a href="#sec-7">7 抽象数据类型 </a>
<ul>
<li><a href="#sec-7-1">7.1 用链实现的栈 </a>
<ul>
<li><a href="#sec-7-1-1">7.1.1 例子 </a></li>
</ul>
</li>
<li><a href="#sec-7-2">7.2 用链表实现的队列 </a>
<ul>
<li><a href="#sec-7-2-1">7.2.1 例子 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-8">8 有序链表 </a>
<ul>
<li><a href="#sec-8-1">8.1 特点 </a></li>
<li><a href="#sec-8-2">8.2 插入 </a></li>
<li><a href="#sec-8-3">8.3 效率 </a></li>
<li><a href="#sec-8-4">8.4 表插入排序 </a></li>
</ul>
</li>
<li><a href="#sec-9">9 双向链表 </a>
<ul>
<li><a href="#sec-9-1">9.1 特点 </a></li>
<li><a href="#sec-9-2">9.2 例子 </a></li>
</ul>
</li>
<li><a href="#sec-10">10 迭代器 </a>
<ul>
<li><a href="#sec-10-1">10.1 作用 </a></li>
<li><a href="#sec-10-2">10.2 例子 </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 序言 </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 数组的缺点 </h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>插入/搜索/删除低效
</li>
<li>大小不可变
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 链表 </h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>解决数组的缺点
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 链接点 </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 特点 </h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li>数据项包含在Link中
</li>
<li>每个链接点都是某个Link的对象
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 例子 </h3>
<div class="outline-text-3" id="text-2-2">




<pre class="src src-java">  <span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">Link</span>
{
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">Object</span> <span style="color: #7fffd4; font-weight: bold;">obj</span> ;
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">next</span>;
}
</pre>



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 单链表 </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 特点 </h3>
<div class="outline-text-3" id="text-3-1">

<ul>
<li>表头插入数据
</li>
<li>表头删除数据
</li>
</ul>

<p> 0 遍历链表显示内容
</p></div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 例子 </h3>
<div class="outline-text-3" id="text-3-2">




<pre class="src src-java"> <span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">Link</span>
   {
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">iData</span>;              <span style="color: #add8e6;">// </span><span style="color: #add8e6;">data item</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">double</span> <span style="color: #7fffd4; font-weight: bold;">dData</span>;           <span style="color: #add8e6;">// </span><span style="color: #add8e6;">data item</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">next</span>;              <span style="color: #add8e6;">// </span><span style="color: #add8e6;">next link in list</span>
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> Link(<span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">id</span>, <span style="color: #9acd32; font-weight: bold;">double</span> <span style="color: #7fffd4; font-weight: bold;">dd</span>) <span style="color: #add8e6;">// </span><span style="color: #add8e6;">constructor</span>
      {
      iData = id;                 <span style="color: #add8e6;">// </span><span style="color: #add8e6;">initialize data</span>
      dData = dd;                 <span style="color: #add8e6;">// </span><span style="color: #add8e6;">('next' is automatically</span>
      }                           <span style="color: #add8e6;">//  </span><span style="color: #add8e6;">set to null)</span>
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">displayLink</span>()      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">display ourself</span>
      {
      System.out.print(<span style="color: #ffa07a;">"{"</span> + iData + <span style="color: #ffa07a;">", "</span> + dData + <span style="color: #ffa07a;">"} "</span>);
      }
   }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end class Link</span>
<span style="color: #add8e6;">////////////////////////////////////////////////////////////////</span>
<span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">LinkList</span>
   {
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">first</span>;            <span style="color: #add8e6;">// </span><span style="color: #add8e6;">ref to first link on list</span>

<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> LinkList()              <span style="color: #add8e6;">// </span><span style="color: #add8e6;">constructor</span>
      {
      first = <span style="color: #7fffd4;">null</span>;               <span style="color: #add8e6;">// </span><span style="color: #add8e6;">no links on list yet</span>
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">boolean</span> <span style="color: #7fffd4; font-weight: bold;">isEmpty</span>()       <span style="color: #add8e6;">// </span><span style="color: #add8e6;">true if list is empty</span>
      {
      <span style="color: #fa8072;">return</span> (first==<span style="color: #7fffd4;">null</span>);
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
                                  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">insert at start of list</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">insertFirst</span>(<span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">id</span>, <span style="color: #9acd32; font-weight: bold;">double</span> <span style="color: #7fffd4; font-weight: bold;">dd</span>)
      {                           <span style="color: #add8e6;">// </span><span style="color: #add8e6;">make new link</span>
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">newLink</span> = <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">Link</span>(id, dd);
      newLink.next = first;       <span style="color: #add8e6;">// </span><span style="color: #add8e6;">newLink --&gt; old first</span>
      first = newLink;            <span style="color: #add8e6;">// </span><span style="color: #add8e6;">first --&gt; newLink</span>
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">deleteFirst</span>()      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">delete first item</span>
      {                           <span style="color: #add8e6;">// </span><span style="color: #add8e6;">(assumes list not empty)</span>
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">temp</span> = first;          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">save reference to link</span>
      first = first.next;         <span style="color: #add8e6;">// </span><span style="color: #add8e6;">delete it: first--&gt;old next</span>
      <span style="color: #fa8072;">return</span> temp;                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">return deleted link</span>
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">displayList</span>()
      {
      System.out.print(<span style="color: #ffa07a;">"List (first--&gt;last): "</span>);
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">current</span> = first;       <span style="color: #add8e6;">// </span><span style="color: #add8e6;">start at beginning of list</span>
      <span style="color: #fa8072;">while</span>(current != <span style="color: #7fffd4;">null</span>)      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">until end of list,</span>
         {
         current.displayLink();   <span style="color: #add8e6;">// </span><span style="color: #add8e6;">print data</span>
         current = current.next;  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">move to next link</span>
         }
      System.out.println(<span style="color: #ffa07a;">""</span>);
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end class LinkList</span>
</pre>



</div>
</div>

</div>
