publish/html/链表.html

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 查找和删除指定链接点 </h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> find </h3>
<div class="outline-text-3" id="text-4-1">

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> delete </h3>
<div class="outline-text-3" id="text-4-2">

</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 例子 </h3>
<div class="outline-text-3" id="text-4-3">




<pre class="src src-java"> <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">find</span>(<span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">key</span>)      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">find link with given key</span>
      {                           <span style="color: #add8e6;">// </span><span style="color: #add8e6;">(assumes non-empty list)</span>
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">current</span> = first;              <span style="color: #add8e6;">// </span><span style="color: #add8e6;">start at 'first'</span>
      <span style="color: #fa8072;">while</span>(current.iData != key)        <span style="color: #add8e6;">// </span><span style="color: #add8e6;">while no match,</span>
         {
         <span style="color: #fa8072;">if</span>(current.next == <span style="color: #7fffd4;">null</span>)        <span style="color: #add8e6;">// </span><span style="color: #add8e6;">if end of list,</span>
            <span style="color: #fa8072;">return</span> <span style="color: #7fffd4;">null</span>;                 <span style="color: #add8e6;">// </span><span style="color: #add8e6;">didn't find it</span>
         <span style="color: #fa8072;">else</span>                            <span style="color: #add8e6;">// </span><span style="color: #add8e6;">not end of list,</span>
            current = current.next;      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">go to next link</span>
         }
      <span style="color: #fa8072;">return</span> current;                    <span style="color: #add8e6;">// </span><span style="color: #add8e6;">found it</span>
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">delete</span>(<span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">key</span>)    <span style="color: #add8e6;">// </span><span style="color: #add8e6;">delete link with given key</span>
      {                           <span style="color: #add8e6;">// </span><span style="color: #add8e6;">(assumes non-empty list)</span>
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">current</span> = first;              <span style="color: #add8e6;">// </span><span style="color: #add8e6;">search for link</span>
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">previous</span> = first;
      <span style="color: #fa8072;">while</span>(current.iData != key)
         {
         <span style="color: #fa8072;">if</span>(current.next == <span style="color: #7fffd4;">null</span>)
            <span style="color: #fa8072;">return</span> <span style="color: #7fffd4;">null</span>;                 <span style="color: #add8e6;">// </span><span style="color: #add8e6;">didn't find it</span>
         <span style="color: #fa8072;">else</span>
            {
            previous = current;          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">go to next link</span>
            current = current.next;
            }
         }                               <span style="color: #add8e6;">// </span><span style="color: #add8e6;">found it</span>
      <span style="color: #fa8072;">if</span>(current == first)               <span style="color: #add8e6;">// </span><span style="color: #add8e6;">if first link,</span>
         first = first.next;             <span style="color: #add8e6;">//    </span><span style="color: #add8e6;">change first</span>
      <span style="color: #fa8072;">else</span>                               <span style="color: #add8e6;">// </span><span style="color: #add8e6;">otherwise,</span>
         previous.next = current.next;   <span style="color: #add8e6;">//    </span><span style="color: #add8e6;">bypass it</span>
      <span style="color: #fa8072;">return</span> current;
      }
</pre>



</div>
</div>

</div>
