publish/html/链表.html

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 双端链接点 </h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 特点 </h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li>可在表尾直接插入一个链接点
</li>
</ul>

</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 例子 </h3>
<div class="outline-text-3" id="text-5-2">




<pre class="src src-java"> <span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">Link</span>
   {
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">dData</span>;                 <span style="color: #add8e6;">// </span><span style="color: #add8e6;">data item</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">next</span>;                  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">next link in list</span>
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> Link(<span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">d</span>)                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">constructor</span>
      { dData = d; }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">displayLink</span>()          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">display this link</span>
      { System.out.print(dData + <span style="color: #ffa07a;">" "</span>); }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end class Link</span>
<span style="color: #add8e6;">////////////////////////////////////////////////////////////////</span>
<span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">FirstLastList</span>
   {
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">first</span>;               <span style="color: #add8e6;">// </span><span style="color: #add8e6;">ref to first link</span>
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">last</span>;                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">ref to last link</span>
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> FirstLastList()            <span style="color: #add8e6;">// </span><span style="color: #add8e6;">constructor</span>
      {
      first = <span style="color: #7fffd4;">null</span>;                  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">no links on list yet</span>
      last = <span style="color: #7fffd4;">null</span>;
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">boolean</span> <span style="color: #7fffd4; font-weight: bold;">isEmpty</span>()          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">true if no links</span>
      { <span style="color: #fa8072;">return</span> first==<span style="color: #7fffd4;">null</span>; }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">insertFirst</span>(<span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">dd</span>)  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">insert at front of list</span>
      {
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">newLink</span> = <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">Link</span>(dd);   <span style="color: #add8e6;">// </span><span style="color: #add8e6;">make new link</span>

      <span style="color: #fa8072;">if</span>( isEmpty() )                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">if empty list,</span>
         last = newLink;             <span style="color: #add8e6;">// </span><span style="color: #add8e6;">newLink &lt;-- last</span>
      newLink.next = first;          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">newLink --&gt; old first</span>
      first = newLink;               <span style="color: #add8e6;">// </span><span style="color: #add8e6;">first --&gt; newLink</span>
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">insertLast</span>(<span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">dd</span>)   <span style="color: #add8e6;">// </span><span style="color: #add8e6;">insert at end of list</span>
      {
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">newLink</span> = <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">Link</span>(dd);   <span style="color: #add8e6;">// </span><span style="color: #add8e6;">make new link</span>
      <span style="color: #fa8072;">if</span>( isEmpty() )                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">if empty list,</span>
         first = newLink;            <span style="color: #add8e6;">// </span><span style="color: #add8e6;">first --&gt; newLink</span>
      <span style="color: #fa8072;">else</span>
         last.next = newLink;        <span style="color: #add8e6;">// </span><span style="color: #add8e6;">old last --&gt; newLink</span>
      last = newLink;                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">newLink &lt;-- last</span>
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">deleteFirst</span>()         <span style="color: #add8e6;">// </span><span style="color: #add8e6;">delete first link</span>
      {                              <span style="color: #add8e6;">// </span><span style="color: #add8e6;">(assumes non-empty list)</span>
      <span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">temp</span> = first.dData;
      <span style="color: #fa8072;">if</span>(first.next == <span style="color: #7fffd4;">null</span>)         <span style="color: #add8e6;">// </span><span style="color: #add8e6;">if only one item</span>
         last = <span style="color: #7fffd4;">null</span>;                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">null &lt;-- last</span>
      first = first.next;            <span style="color: #add8e6;">// </span><span style="color: #add8e6;">first --&gt; old next</span>
      <span style="color: #fa8072;">return</span> temp;
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">displayList</span>()
      {
      System.out.print(<span style="color: #ffa07a;">"List (first--&gt;last): "</span>);
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">current</span> = first;          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">start at beginning</span>
      <span style="color: #fa8072;">while</span>(current != <span style="color: #7fffd4;">null</span>)         <span style="color: #add8e6;">// </span><span style="color: #add8e6;">until end of list,</span>
         {
         current.displayLink();      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">print data</span>
         current = current.next;     <span style="color: #add8e6;">// </span><span style="color: #add8e6;">move to next link</span>
         }
      System.out.println(<span style="color: #ffa07a;">""</span>);
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end class FirstLastList</span>
</pre>



</div>
</div>

</div>
