publish/html/链表.html

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 链表的效率 </h2>
<div class="outline-text-2" id="text-6">

<ul>
<li>表头插入和删除速度块
</li>
<li>查找和删除指定链接点
</li>
<li>无容量限制
</li>
</ul>

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 抽象数据类型 </h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 用链实现的栈 </h3>
<div class="outline-text-3" id="text-7-1">


</div>

<div id="outline-container-7-1-1" class="outline-4">
<h4 id="sec-7-1-1"><span class="section-number-4">7.1.1</span> 例子 </h4>
<div class="outline-text-4" id="text-7-1-1">




<pre class="src src-java">  <span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">Link</span>
   {
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">dData</span>;             <span style="color: #add8e6;">// </span><span style="color: #add8e6;">data item</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">next</span>;              <span style="color: #add8e6;">// </span><span style="color: #add8e6;">next link in list</span>
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> Link(<span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">dd</span>)           <span style="color: #add8e6;">// </span><span style="color: #add8e6;">constructor</span>
      { dData = dd; }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">displayLink</span>()      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">display ourself</span>
      { System.out.print(dData + <span style="color: #ffa07a;">" "</span>); }
   }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end class Link</span>
<span style="color: #add8e6;">////////////////////////////////////////////////////////////////</span>
<span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">LinkList</span>
   {
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">first</span>;            <span style="color: #add8e6;">// </span><span style="color: #add8e6;">ref to first item on list</span>
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> LinkList()              <span style="color: #add8e6;">// </span><span style="color: #add8e6;">constructor</span>
      { first = <span style="color: #7fffd4;">null</span>; }           <span style="color: #add8e6;">// </span><span style="color: #add8e6;">no items on list yet</span>
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">boolean</span> <span style="color: #7fffd4; font-weight: bold;">isEmpty</span>()       <span style="color: #add8e6;">// </span><span style="color: #add8e6;">true if list is empty</span>
      { <span style="color: #fa8072;">return</span> (first==<span style="color: #7fffd4;">null</span>); }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">insertFirst</span>(<span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">dd</span>) <span style="color: #add8e6;">// </span><span style="color: #add8e6;">insert at start of list</span>
      {                           <span style="color: #add8e6;">// </span><span style="color: #add8e6;">make new link</span>
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">newLink</span> = <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">Link</span>(dd);
      newLink.next = first;       <span style="color: #add8e6;">// </span><span style="color: #add8e6;">newLink --&gt; old first</span>
      first = newLink;            <span style="color: #add8e6;">// </span><span style="color: #add8e6;">first --&gt; newLink</span>
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">deleteFirst</span>()      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">delete first item</span>
      {                           <span style="color: #add8e6;">// </span><span style="color: #add8e6;">(assumes list not empty)</span>
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">temp</span> = first;          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">save reference to link</span>
      first = first.next;         <span style="color: #add8e6;">// </span><span style="color: #add8e6;">delete it: first--&gt;old next</span>
      <span style="color: #fa8072;">return</span> temp.dData;          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">return deleted link</span>
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">displayList</span>()
      {
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">current</span> = first;       <span style="color: #add8e6;">// </span><span style="color: #add8e6;">start at beginning of list</span>
      <span style="color: #fa8072;">while</span>(current != <span style="color: #7fffd4;">null</span>)      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">until end of list,</span>
         {
         current.displayLink();   <span style="color: #add8e6;">// </span><span style="color: #add8e6;">print data</span>
         current = current.next;  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">move to next link</span>
         }
      System.out.println(<span style="color: #ffa07a;">""</span>);
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end class LinkList</span>
<span style="color: #add8e6;">////////////////////////////////////////////////////////////////</span>
<span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">LinkStack</span>
   {
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">LinkList</span> <span style="color: #7fffd4; font-weight: bold;">theList</span>;
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> LinkStack()             <span style="color: #add8e6;">// </span><span style="color: #add8e6;">constructor</span>
      {
      theList = <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">LinkList</span>();
      }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">push</span>(<span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">j</span>)     <span style="color: #add8e6;">// </span><span style="color: #add8e6;">put item on top of stack</span>
      {
      theList.insertFirst(j);
      }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">pop</span>()            <span style="color: #add8e6;">// </span><span style="color: #add8e6;">take item from top of stack</span>
      {
      <span style="color: #fa8072;">return</span> theList.deleteFirst();
      }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">boolean</span> <span style="color: #7fffd4; font-weight: bold;">isEmpty</span>()       <span style="color: #add8e6;">// </span><span style="color: #add8e6;">true if stack is empty</span>
      {
      <span style="color: #fa8072;">return</span> ( theList.isEmpty() );
      }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">displayStack</span>()
      {
      System.out.print(<span style="color: #ffa07a;">"Stack (top--&gt;bottom): "</span>);
      theList.displayList();
      }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end class LinkStack</span>
</pre>



</div>
</div>

</div>
