数据结构/链表.org
*** 例子
#+BEGIN_SRC java
  class LinkQueue
   {
   private FirstLastList theList;
//--------------------------------------------------------------
   public LinkQueue()                // constructor
      { theList = new FirstLastList(); }  // make a 2-ended list
//--------------------------------------------------------------
   public boolean isEmpty()          // true if queue is empty
      { return theList.isEmpty(); }
//--------------------------------------------------------------
   public void insert(long j)        // insert, rear of queue
      { theList.insertLast(j); }
//--------------------------------------------------------------
   public long remove()              // remove, front of queue
      {  return theList.deleteFirst();  }
//--------------------------------------------------------------
   public void displayQueue()
      {
      System.out.print("Queue (front-->rear): ");
      theList.displayList();
      }
//--------------------------------------------------------------
   }  // end class LinkQueue
#+END_SRC
* 有序链表
** 特点
 - 数据按照关键值有序排列
** 插入
 - 例子
#+BEGIN_SRC java
# 插入与无序链表不同
   public void insert(long key)        // insert, in order
      {
      Link newLink = new Link(key);    // make new link
      Link previous = null;            // start at first
      Link current = first;
                                       // until end of list,
# 如果插入的值比当前链接的值要大,则比较下一个位置的值
      while(current != null && key > current.dData)
         {                             // or key > current,
         previous = current;
         current = current.next;       // go to next item
         }
# 如果当前链接点为空,则将新链接点添加到链表中
      if(previous==null)               // at beginning of list
         first = newLink;              // first --> newLink
      else                             // not at beginning
# 如果当前链接点非空,则将前一位置指向新链接点
         previous.next = newLink;      // old prev --> newLink
# 新链接点指向当前位置的链接点
      newLink.next = current;          // newLink --> old currnt
      }  // end insert()
#+END_SRC
** 效率
 - 插入和删除操作需要O(N)次比较
** 表插入排序
 - 将一个无序数组插入一个有序链表中,再删除,将每个元素依次放入数组中
* 双向链表
** 特点
 - 解决反向遍历的问题
