publish/html/链表.html

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 用链表实现的队列 </h3>
<div class="outline-text-3" id="text-7-2">


</div>

<div id="outline-container-7-2-1" class="outline-4">
<h4 id="sec-7-2-1"><span class="section-number-4">7.2.1</span> 例子 </h4>
<div class="outline-text-4" id="text-7-2-1">




<pre class="src src-java">  <span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">LinkQueue</span>
   {
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">FirstLastList</span> <span style="color: #7fffd4; font-weight: bold;">theList</span>;
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> LinkQueue()                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">constructor</span>
      { theList = <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">FirstLastList</span>(); }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">make a 2-ended list</span>
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">boolean</span> <span style="color: #7fffd4; font-weight: bold;">isEmpty</span>()          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">true if queue is empty</span>
      { <span style="color: #fa8072;">return</span> theList.isEmpty(); }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">insert</span>(<span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">j</span>)        <span style="color: #add8e6;">// </span><span style="color: #add8e6;">insert, rear of queue</span>
      { theList.insertLast(j); }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">remove</span>()              <span style="color: #add8e6;">// </span><span style="color: #add8e6;">remove, front of queue</span>
      {  <span style="color: #fa8072;">return</span> theList.deleteFirst();  }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">displayQueue</span>()
      {
      System.out.print(<span style="color: #ffa07a;">"Queue (front--&gt;rear): "</span>);
      theList.displayList();
      }
<span style="color: #add8e6;">//</span><span style="color: #add8e6;">--------------------------------------------------------------</span>
   }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end class LinkQueue</span>
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 有序链表 </h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> 特点 </h3>
<div class="outline-text-3" id="text-8-1">

<ul>
<li>数据按照关键值有序排列
</li>
</ul>

</div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> 插入 </h3>
<div class="outline-text-3" id="text-8-2">

<ul>
<li>例子
</li>
</ul>




<pre class="src src-java"># &#25554;&#20837;&#19982;&#26080;&#24207;&#38142;&#34920;&#19981;&#21516;
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> insert(<span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">key</span>)        <span style="color: #add8e6;">// </span><span style="color: #add8e6;">insert, in order</span>
      {
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">newLink</span> = <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">Link</span>(key);    <span style="color: #add8e6;">// </span><span style="color: #add8e6;">make new link</span>
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">previous</span> = <span style="color: #7fffd4;">null</span>;            <span style="color: #add8e6;">// </span><span style="color: #add8e6;">start at first</span>
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">current</span> = first;
                                       <span style="color: #add8e6;">// </span><span style="color: #add8e6;">until end of list,</span>
# &#22914;&#26524;&#25554;&#20837;&#30340;&#20540;&#27604;&#24403;&#21069;&#38142;&#25509;&#30340;&#20540;&#35201;&#22823;,&#21017;&#27604;&#36739;&#19979;&#19968;&#20010;&#20301;&#32622;&#30340;&#20540;
      <span style="color: #fa8072;">while</span>(current != <span style="color: #7fffd4;">null</span> &amp;&amp; key &gt; current.dData)
         {                             <span style="color: #add8e6;">// </span><span style="color: #add8e6;">or key &gt; current,</span>
         previous = current;
         current = current.next;       <span style="color: #add8e6;">// </span><span style="color: #add8e6;">go to next item</span>
         }
# &#22914;&#26524;&#24403;&#21069;&#38142;&#25509;&#28857;&#20026;&#31354;,&#21017;&#23558;&#26032;&#38142;&#25509;&#28857;&#28155;&#21152;&#21040;&#38142;&#34920;&#20013;
      <span style="color: #fa8072;">if</span>(previous==<span style="color: #7fffd4;">null</span>)               <span style="color: #add8e6;">// </span><span style="color: #add8e6;">at beginning of list</span>
         first = newLink;              <span style="color: #add8e6;">// </span><span style="color: #add8e6;">first --&gt; newLink</span>
      <span style="color: #fa8072;">else</span>                             <span style="color: #add8e6;">// </span><span style="color: #add8e6;">not at beginning</span>
# &#22914;&#26524;&#24403;&#21069;&#38142;&#25509;&#28857;&#38750;&#31354;,<span style="color: #9acd32; font-weight: bold;">&#21017;&#23558;&#21069;&#19968;&#20301;&#32622;&#25351;&#21521;&#26032;&#38142;&#25509;&#28857;</span>
         previous.<span style="color: #7fffd4; font-weight: bold;">next</span> = newLink;      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">old prev --&gt; newLink</span>
# &#26032;&#38142;&#25509;&#28857;&#25351;&#21521;&#24403;&#21069;&#20301;&#32622;&#30340;&#38142;&#25509;&#28857;
      newLink.next = current;          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">newLink --&gt; old currnt</span>
      }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end insert()</span>
</pre>



</div>

</div>

<div id="outline-container-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> 效率 </h3>
<div class="outline-text-3" id="text-8-3">

<ul>
<li>插入和删除操作需要O(N)次比较
</li>
</ul>

</div>

</div>

<div id="outline-container-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> 表插入排序 </h3>
<div class="outline-text-3" id="text-8-4">

<ul>
<li>将一个无序数组插入一个有序链表中,再删除,将每个元素依次放入数组中
</li>
</ul>

</div>
</div>

</div>
