publish/html/链表.html

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 双向链表 </h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> 特点 </h3>
<div class="outline-text-3" id="text-9-1">

<ul>
<li>解决反向遍历的问题
</li>
</ul>

</div>

</div>

<div id="outline-container-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> 例子 </h3>
<div class="outline-text-3" id="text-9-2">




<pre class="src src-java">  <span style="color: #fa8072;">class</span> <span style="color: #9acd32; font-weight: bold;">DoublyLinkedList</span>
   {
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">first</span>;               <span style="color: #add8e6;">// </span><span style="color: #add8e6;">ref to first item</span>
   <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">last</span>;                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">ref to last item</span>
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> DoublyLinkedList()         <span style="color: #add8e6;">// </span><span style="color: #add8e6;">constructor</span>
      {
      first = <span style="color: #7fffd4;">null</span>;                  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">no items on list yet</span>
      last = <span style="color: #7fffd4;">null</span>;
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">boolean</span> <span style="color: #7fffd4; font-weight: bold;">isEmpty</span>()          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">true if no links</span>
      { <span style="color: #fa8072;">return</span> first==<span style="color: #7fffd4;">null</span>; }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">insertFirst</span>(<span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">dd</span>)  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">insert at front of list</span>
      {
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">newLink</span> = <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">Link</span>(dd);   <span style="color: #add8e6;">// </span><span style="color: #add8e6;">make new link</span>

      <span style="color: #fa8072;">if</span>( isEmpty() )                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">if empty list,</span>
         last = newLink;             <span style="color: #add8e6;">// </span><span style="color: #add8e6;">newLink &lt;-- last</span>
      <span style="color: #fa8072;">else</span>
         first.previous = newLink;   <span style="color: #add8e6;">// </span><span style="color: #add8e6;">newLink &lt;-- old first</span>
      newLink.next = first;          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">newLink --&gt; old first</span>
      first = newLink;               <span style="color: #add8e6;">// </span><span style="color: #add8e6;">first --&gt; newLink</span>
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">insertLast</span>(<span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">dd</span>)   <span style="color: #add8e6;">// </span><span style="color: #add8e6;">insert at end of list</span>
      {
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">newLink</span> = <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">Link</span>(dd);   <span style="color: #add8e6;">// </span><span style="color: #add8e6;">make new link</span>
      <span style="color: #fa8072;">if</span>( isEmpty() )                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">if empty list,</span>
         first = newLink;            <span style="color: #add8e6;">// </span><span style="color: #add8e6;">first --&gt; newLink</span>
      <span style="color: #fa8072;">else</span>
         {
         last.next = newLink;        <span style="color: #add8e6;">// </span><span style="color: #add8e6;">old last --&gt; newLink</span>
         newLink.previous = last;    <span style="color: #add8e6;">// </span><span style="color: #add8e6;">old last &lt;-- newLink</span>
         }
      last = newLink;                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">newLink &lt;-- last</span>
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">deleteFirst</span>()         <span style="color: #add8e6;">// </span><span style="color: #add8e6;">delete first link</span>
      {                              <span style="color: #add8e6;">// </span><span style="color: #add8e6;">(assumes non-empty list)</span>
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">temp</span> = first;
      <span style="color: #fa8072;">if</span>(first.next == <span style="color: #7fffd4;">null</span>)         <span style="color: #add8e6;">// </span><span style="color: #add8e6;">if only one item</span>
         last = <span style="color: #7fffd4;">null</span>;                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">null &lt;-- last</span>
      <span style="color: #fa8072;">else</span>
         first.next.previous = <span style="color: #7fffd4;">null</span>; <span style="color: #add8e6;">// </span><span style="color: #add8e6;">null &lt;-- old next</span>
      first = first.next;            <span style="color: #add8e6;">// </span><span style="color: #add8e6;">first --&gt; old next</span>
      <span style="color: #fa8072;">return</span> temp;
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">deleteLast</span>()          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">delete last link</span>
      {                              <span style="color: #add8e6;">// </span><span style="color: #add8e6;">(assumes non-empty list)</span>
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">temp</span> = last;
      <span style="color: #fa8072;">if</span>(first.next == <span style="color: #7fffd4;">null</span>)         <span style="color: #add8e6;">// </span><span style="color: #add8e6;">if only one item</span>
         first = <span style="color: #7fffd4;">null</span>;               <span style="color: #add8e6;">// </span><span style="color: #add8e6;">first --&gt; null</span>
      <span style="color: #fa8072;">else</span>
         last.previous.next = <span style="color: #7fffd4;">null</span>;  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">old previous --&gt; null</span>
      last = last.previous;          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">old previous &lt;-- last</span>
      <span style="color: #fa8072;">return</span> temp;
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
                                     <span style="color: #add8e6;">// </span><span style="color: #add8e6;">insert dd just after key</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">boolean</span> <span style="color: #7fffd4; font-weight: bold;">insertAfter</span>(<span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">key</span>, <span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">dd</span>)
      {                              <span style="color: #add8e6;">// </span><span style="color: #add8e6;">(assumes non-empty list)</span>
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">current</span> = first;          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">start at beginning</span>
      <span style="color: #fa8072;">while</span>(current.dData != key)    <span style="color: #add8e6;">// </span><span style="color: #add8e6;">until match is found,</span>
         {
         current = current.next;     <span style="color: #add8e6;">// </span><span style="color: #add8e6;">move to next link</span>
         <span style="color: #fa8072;">if</span>(current == <span style="color: #7fffd4;">null</span>)
            <span style="color: #fa8072;">return</span> <span style="color: #7fffd4;">false</span>;            <span style="color: #add8e6;">// </span><span style="color: #add8e6;">didn't find it</span>
         }
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">newLink</span> = <span style="color: #fa8072;">new</span> <span style="color: #9acd32; font-weight: bold;">Link</span>(dd);   <span style="color: #add8e6;">// </span><span style="color: #add8e6;">make new link</span>

      <span style="color: #fa8072;">if</span>(current==last)              <span style="color: #add8e6;">// </span><span style="color: #add8e6;">if last link,</span>
         {
         newLink.next = <span style="color: #7fffd4;">null</span>;        <span style="color: #add8e6;">// </span><span style="color: #add8e6;">newLink --&gt; null</span>
         last = newLink;             <span style="color: #add8e6;">// </span><span style="color: #add8e6;">newLink &lt;-- last</span>
         }
      <span style="color: #fa8072;">else</span>                           <span style="color: #add8e6;">// </span><span style="color: #add8e6;">not last link,</span>
         {
         newLink.next = current.next; <span style="color: #add8e6;">// </span><span style="color: #add8e6;">newLink --&gt; old next</span>
                                      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">newLink &lt;-- old next</span>
         current.next.previous = newLink;
         }
      newLink.previous = current;    <span style="color: #add8e6;">// </span><span style="color: #add8e6;">old current &lt;-- newLink</span>
      current.next = newLink;        <span style="color: #add8e6;">// </span><span style="color: #add8e6;">old current --&gt; newLink</span>
      <span style="color: #fa8072;">return</span> <span style="color: #7fffd4;">true</span>;                   <span style="color: #add8e6;">// </span><span style="color: #add8e6;">found it, did insertion</span>
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">deleteKey</span>(<span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">key</span>)   <span style="color: #add8e6;">// </span><span style="color: #add8e6;">delete item w/ given key</span>
      {                              <span style="color: #add8e6;">// </span><span style="color: #add8e6;">(assumes non-empty list)</span>
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">current</span> = first;          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">start at beginning</span>
      <span style="color: #fa8072;">while</span>(current.dData != key)    <span style="color: #add8e6;">// </span><span style="color: #add8e6;">until match is found,</span>
         {
         current = current.next;     <span style="color: #add8e6;">// </span><span style="color: #add8e6;">move to next link</span>
         <span style="color: #fa8072;">if</span>(current == <span style="color: #7fffd4;">null</span>)
            <span style="color: #fa8072;">return</span> <span style="color: #7fffd4;">null</span>;             <span style="color: #add8e6;">// </span><span style="color: #add8e6;">didn't find it</span>
         }
      <span style="color: #fa8072;">if</span>(current==first)             <span style="color: #add8e6;">// </span><span style="color: #add8e6;">found it; first item?</span>
         first = current.next;       <span style="color: #add8e6;">// </span><span style="color: #add8e6;">first --&gt; old next</span>
      <span style="color: #fa8072;">else</span>                           <span style="color: #add8e6;">// </span><span style="color: #add8e6;">not first</span>
                                     <span style="color: #add8e6;">// </span><span style="color: #add8e6;">old previous --&gt; old next</span>
         current.previous.next = current.next;

      <span style="color: #fa8072;">if</span>(current==last)              <span style="color: #add8e6;">// </span><span style="color: #add8e6;">last item?</span>
         last = current.previous;    <span style="color: #add8e6;">// </span><span style="color: #add8e6;">old previous &lt;-- last</span>
      <span style="color: #fa8072;">else</span>                           <span style="color: #add8e6;">// </span><span style="color: #add8e6;">not last</span>
                                     <span style="color: #add8e6;">// </span><span style="color: #add8e6;">old previous &lt;-- old next</span>
         current.next.previous = current.previous;
      <span style="color: #fa8072;">return</span> current;                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">return value</span>
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">displayForward</span>()
      {
      System.out.print(<span style="color: #ffa07a;">"List (first--&gt;last): "</span>);
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">current</span> = first;          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">start at beginning</span>
      <span style="color: #fa8072;">while</span>(current != <span style="color: #7fffd4;">null</span>)         <span style="color: #add8e6;">// </span><span style="color: #add8e6;">until end of list,</span>
         {
         current.displayLink();      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">display data</span>
         current = current.next;     <span style="color: #add8e6;">// </span><span style="color: #add8e6;">move to next link</span>
         }
      System.out.println(<span style="color: #ffa07a;">""</span>);
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">displayBackward</span>()
      {
      System.out.print(<span style="color: #ffa07a;">"List (last--&gt;first): "</span>);
      <span style="color: #9acd32; font-weight: bold;">Link</span> <span style="color: #7fffd4; font-weight: bold;">current</span> = last;           <span style="color: #add8e6;">// </span><span style="color: #add8e6;">start at end</span>
      <span style="color: #fa8072;">while</span>(current != <span style="color: #7fffd4;">null</span>)         <span style="color: #add8e6;">// </span><span style="color: #add8e6;">until start of list,</span>
         {
         current.displayLink();      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">display data</span>
         current = current.previous; <span style="color: #add8e6;">// </span><span style="color: #add8e6;">move to previous link</span>
         }
      System.out.println(<span style="color: #ffa07a;">""</span>);
      }
<span style="color: #add8e6;">// </span><span style="color: #add8e6;">-------------------------------------------------------------</span>
   }
</pre>



</div>
</div>

</div>
